УТ_для_edt/src/Documents/смартУстановкаИндивидуальныхСкидокКлиентов/смартУстановкаИндивидуальныхСкидокКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартУстановкаИндивидуальныхСкидокКлиентов</name>
  <comment>#1323 смарт: Лопато 21.09.2023 //Восстановить и переделать механизм индивидуальных скидок</comment>
  <registerRecords>InformationRegister.смартИндивидуальныеСкидкиКлиентов</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Клиенты</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Скидки</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоДействия</name>
      <comment>#1868 смарт: Лопато 19.06.2024 //Доработать механизм индивидуальных скидок (прод 1323)</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокДействия</name>
      <comment>#1868 смарт: Лопато 19.06.2024 //Доработать механизм индивидуальных скидок (прод 1323)</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/InformationRegisters/смартИндивидуальныеСкидкиКлиентов/смартИндивидуальныеСкидкиКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартИндивидуальныеСкидкиКлиентов</name>
  <comment>#1323 смарт: Лопато 15.03.2023 //Восстановить и переделать механизм индивидуальных скидок</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПроцентСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <comment>#1870 смарт: Лопато 24.06.2024 //Доработать механизм выгрузки индивидуальных скидок</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Documents/смартУстановкаИндивидуальныхСкидокКлиентов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ЭтоНовый() Тогда
		ИнициализироватьДокумент(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	ПроверитьТаблицуСкидок(Отказ);
	
КонецПроцедуры                         

Процедура ПроверитьТаблицуСкидок(Отказ);
	
	Для Каждого СтрКлиент Из Клиенты Цикл

		Если НЕ ЗначениеЗаполнено(СтрКлиент.Клиент) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Клиент"" не может быть пустым!", , , , Отказ);
		КонецЕсли;
		
		Если НЕ смартОбщегоНазначения.смартПравоРедактированияИндивидуальныхСкидокПартнера(СтрКлиент.Клиент) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недостаточно прав для редактирования индивидуальных скидок клиента """ + СокрЛП(СтрКлиент.Клиент) + """!", , , , Отказ);
		КонецЕсли;

	КонецЦикла;
	
	МаксимальнаяИндивидуальнаяСкидка = смартОбщегоНазначения.смартМаксимальнаяИндивидуальнаяСкидкаПартнера();
	
	Для Каждого СтрокаИндивидуальнойСкидки Из Скидки Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаИндивидуальнойСкидки.Номенклатура) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Номенклатура"" не может быть пустым!", , , , Отказ);
		КонецЕсли;
		
		Если СтрокаИндивидуальнойСкидки.ПроцентСкидки <> 0 
			//++#1868 смарт: Лопато 19.06.2024 //Доработать механизм индивидуальных скидок (прод 1323)  
			И НЕ смартОбщегоНазначения.смартДоступноИзменениеПовышеннойСкидкиПартнера()
			//--#1868 смарт: Лопато 19.06.2024
			И СтрокаИндивидуальнойСкидки.ПроцентСкидки > МаксимальнаяИндивидуальнаяСкидка Тогда

			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("В строке %1 устанавливаемая скидка ""%2"", которая больше максимальной индивидуальной скидки клиента ""%3""!",
						  СокрЛП(СтрокаИндивидуальнойСкидки.НомерСтроки), СокрЛП(СтрокаИндивидуальнойСкидки.ПроцентСкидки), СокрЛП(МаксимальнаяИндивидуальнаяСкидка));
						  
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	Документы.смартУстановкаИндивидуальныхСкидокКлиентов.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ОтразитьСмартИндивидуальныеСкидкиКлиентов(ДополнительныеСвойства, Движения, Отказ);
	
	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОтразитьСмартИндивидуальныеСкидкиКлиентов(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСмартИндивидуальныеСкидкиКлиентов;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияСмартИндивидуальныеСкидкиКлиентов            = Движения.смартИндивидуальныеСкидкиКлиентов;
	ДвиженияСмартИндивидуальныеСкидкиКлиентов.Записывать = Истина;
	
	ДвиженияСмартИндивидуальныеСкидкиКлиентов.Загрузить(Таблица);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

// Инициализирует документ
//
Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазы(ЭтотОбъект, СтандартнаяОбработка, Префикс)
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
